apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v1l1.h
#define ADC_CR2_DELS_SHIFT           (4)       /* Bits 2-0: Delay selection */
#define ADC_CR2_DELS_MASK            (0x07 << ADC_CR2_DELS_SHIFT)
#define ADC_CR2_DELS_NODEL           (0x0 << ADC_CR2_DELS_SHIFT)  /* No delay */
#define ADC_CR2_DELS_TILLRD          (0x01 << ADC_CR2_DELS_SHIFT) /* Until the converted data have been read */
#define ADC_CR2_DELS_APB7            (0x02 << ADC_CR2_DELS_SHIFT) /* 7 APB clock cycles after the end of conversion */
#define ADC_CR2_DELS_APB15           (0x03 << ADC_CR2_DELS_SHIFT) /* 15 APB clock cycles after the end of conversion */
#define ADC_CR2_DELS_APB31           (0x04 << ADC_CR2_DELS_SHIFT) /* 31 APB clock cycles after the end of conversion */
#define ADC_CR2_DELS_APB63           (0x05 << ADC_CR2_DELS_SHIFT) /* 63 APB clock cycles after the end of conversion */
#define ADC_CR2_DELS_APB127          (0x06 << ADC_CR2_DELS_SHIFT) /* 127 APB clock cycles after the end of conversion */
#define ADC_CR2_DELS_APB255          (0x07 << ADC_CR2_DELS_SHIFT) /* 255 APB clock cycles after the end of conversion */

#define ADC_CR2_DMA                  (1 << 8)  /* Bit 8: Direct Memory access mode */
#define ADC_CR2_DDS                  (1 << 9)  /* Bit 9: DMA disable selection (for single ADC mode) */
#define ADC_CR2_EOCS                 (1 << 10) /* Bit 10: End of conversion selection */
#define ADC_CR2_ALIGN                (1 << 11) /* Bit 11: Data Alignment */
                                               /* Bits 12-15: Reserved */
#define ADC_CR2_JEXTSEL_SHIFT        (16)      /* Bits 16-19: External event select for injected group */
#define ADC_CR2_JEXTSEL_MASK         (0x0F << ADC_CR2_JEXTSEL_SHIFT)
#  define ADC_CR2_JEXTSEL_T9CC1      (0x00 << ADC_CR2_JEXTSEL_SHIFT) /* 0000: Timer 9 CC1 event */
#  define ADC_CR2_JEXTSEL_T9TRGO     (0x01 << ADC_CR2_JEXTSEL_SHIFT) /* 0001: Timer 9 TRGO event */
#  define ADC_CR2_JEXTSEL_T2TRGO     (0x02 << ADC_CR2_JEXTSEL_SHIFT) /* 0010: Timer 2 TRGO event*/
#  define ADC_CR2_JEXTSEL_T2CC1      (0x03 << ADC_CR2_JEXTSEL_SHIFT) /* 0011: Timer 2 CC1 event */
#  define ADC_CR2_JEXTSEL_T3CC4      (0x04 << ADC_CR2_JEXTSEL_SHIFT) /* 0100: Timer 3 CC4 event */
#  define ADC_CR2_JEXTSEL_T4TRGO     (0x05 << ADC_CR2_JEXTSEL_SHIFT) /* 0101: Timer 4 TRGO event */
#  define ADC_CR2_JEXTSEL_T4CC1      (0x06 << ADC_CR2_JEXTSEL_SHIFT) /* 0110: Timer 4 CC1 event */
#  define ADC_CR2_JEXTSEL_T4CC2      (0x07 << ADC_CR2_JEXTSEL_SHIFT) /* 0111: Timer 4 CC2 event */
#  define ADC_CR2_JEXTSEL_T4CC3      (0x08 << ADC_CR2_JEXTSEL_SHIFT) /* 1000: Timer 4 CC3 event */
#  define ADC_CR2_JEXTSEL_T10CC1     (0x09 << ADC_CR2_JEXTSEL_SHIFT) /* 1001: Timer 10 CC1 event */
#  define ADC_CR2_JEXTSEL_T7TRGO     (0x0A << ADC_CR2_JEXTSEL_SHIFT) /* 1010: Timer 7 TRGO event */
#  define ADC_CR2_JEXTSEL_EXTI15     (0x0F << ADC_CR2_JEXTSEL_SHIFT) /* 1111: EXTI line 15 */

#define ADC_CR2_JEXTEN_SHIFT         (20)      /* Bits 20-21: External trigger enable for injected channels */
#define ADC_CR2_JEXTEN_MASK          (3 << ADC_CR2_JEXTEN_SHIFT)
#  define ADC_CR2_JEXTEN_NONE        (0 << ADC_CR2_JEXTEN_SHIFT) /* 00: Trigger detection disabled */
#  define ADC_CR2_JEXTEN_RISING      (1 << ADC_CR2_JEXTEN_SHIFT) /* 01: Trigger detection on the rising edge */
#  define ADC_CR2_JEXTEN_FALLING     (2 << ADC_CR2_JEXTEN_SHIFT) /* 10: Trigger detection on the falling edge */
#  define ADC_CR2_JEXTEN_BOTH        (3 << ADC_CR2_JEXTEN_SHIFT) /* 11: Trigger detection on both the rising and falling edges */

#define ADC_CR2_JSWSTART             (1 << 22) /* Bit 22: Start Conversion of injected channels */
                                               /* Bit 23: Reserved, must be kept at reset value. */
#define ADC_CR2_EXTSEL_SHIFT         (24)      /* Bits 24-27: External Event Select for regular group */
#define ADC_CR2_EXTSEL_MASK          (0x0F << ADC_CR2_EXTSEL_SHIFT)
#  define ADC_CR2_EXTSEL_T9CC2       (0x00 << ADC_CR2_EXTSEL_SHIFT) /* 0000: Timer 9 CC2 event */
#  define ADC_CR2_EXTSEL_T9TRGO      (0x01 << ADC_CR2_EXTSEL_SHIFT) /* 0001: Timer 9 TRGO event */
#  define ADC_CR2_EXTSEL_T2CC3       (0x02 << ADC_CR2_EXTSEL_SHIFT) /* 0010: Timer 2 CC3 event */
#  define ADC_CR2_EXTSEL_T2CC2       (0x03 << ADC_CR2_EXTSEL_SHIFT) /* 0011: Timer 2 CC2 event */
#  define ADC_CR2_EXTSEL_T3TRGO      (0x04 << ADC_CR2_EXTSEL_SHIFT) /* 0100: Timer 3 TRGO event */
#  define ADC_CR2_EXTSEL_T4CC4       (0x05 << ADC_CR2_EXTSEL_SHIFT) /* 0101: Timer 4 CC4 event */
#  define ADC_CR2_EXTSEL_T2TRGO      (0x06 << ADC_CR2_EXTSEL_SHIFT) /* 0110: Timer 2 TRGO event */
#  define ADC_CR2_EXTSEL_T3CC1       (0x07 << ADC_CR2_EXTSEL_SHIFT) /* 0111: Timer 3 CC1 event */
#  define ADC_CR2_EXTSEL_T3CC3       (0x08 << ADC_CR2_EXTSEL_SHIFT) /* 1000: Timer 3 CC3 event */
#  define ADC_CR2_EXTSEL_T4TRGO      (0x09 << ADC_CR2_EXTSEL_SHIFT) /* 1001: Timer 4 TRGO event */
#  define ADC_CR2_EXTSEL_T6TRGO      (0x0A << ADC_CR2_EXTSEL_SHIFT) /* 1010: Timer 6 TRGO event */
#  define ADC_CR2_EXTSEL_EXTI11      (0x0F << ADC_CR2_EXTSEL_SHIFT) /* 1111: EXTI line 11 */

#define ADC_CR2_EXTEN_SHIFT          (28)      /* Bits 28-29: External trigger enable for regular channels */
#define ADC_CR2_EXTEN_MASK           (3 << ADC_CR2_EXTEN_SHIFT)
#  define ADC_CR2_EXTEN_NONE         (0 << ADC_CR2_EXTEN_SHIFT) /* 00: Trigger detection disabled */
#  define ADC_CR2_EXTEN_RISING       (1 << ADC_CR2_EXTEN_SHIFT) /* 01: Trigger detection on the rising edge */
#  define ADC_CR2_EXTEN_FALLING      (2 << ADC_CR2_EXTEN_SHIFT) /* 10: Trigger detection on the falling edge */
#  define ADC_CR2_EXTEN_BOTH         (3 << ADC_CR2_EXTEN_SHIFT) /* 11: Trigger detection on both the rising and falling edges */

#define ADC_CR2_SWSTART              (1 << 30) /* Bit 30: Start Conversion of regular channels */
#define ADC_CR2_RESERVED             (0x8080f0fc)

/* ADC sample time register 1 */

#define ADC_SMPR_4                   0         /* 000: 3 cycles */
#define ADC_SMPR_9                   1         /* 001: 9 cycles */
#define ADC_SMPR_16                  2         /* 010: 16 cycles */
#define ADC_SMPR_24                  3         /* 011: 24 cycles */
#define ADC_SMPR_48                  4         /* 100: 48 cycles */
#define ADC_SMPR_96                  5         /* 101: 96 cycles */
#define ADC_SMPR_192                 6         /* 110: 192 cycles */
#define ADC_SMPR_384                 7         /* 111: 384 cycles */

#define ADC_SMPR1_SMP20_SHIFT        (0)       /* Bits 0-2: Channel 20 Sample time selection */
#define ADC_SMPR1_SMP20_MASK         (7 << ADC_SMPR1_SMP20_SHIFT)
#define ADC_SMPR1_SMP21_SHIFT        (3)       /* Bits 3-5: Channel 21 Sample time selection */
#define ADC_SMPR1_SMP21_MASK         (7 << ADC_SMPR1_SMP21_SHIFT)
#define ADC_SMPR1_SMP22_SHIFT        (6)       /* Bits 6-8: Channel 22 Sample time selection */
#define ADC_SMPR1_SMP22_MASK         (7 << ADC_SMPR1_SMP22_SHIFT)
#define ADC_SMPR1_SMP23_SHIFT        (9)       /* Bits 9-11: Channel 23 Sample time selection */
#define ADC_SMPR1_SMP23_MASK         (7 << ADC_SMPR1_SMP23_SHIFT)
#define ADC_SMPR1_SMP24_SHIFT        (12)      /* Bits 12-14: Channel 24 Sample time selection */
#define ADC_SMPR1_SMP24_MASK         (7 << ADC_SMPR1_SMP24_SHIFT)
#define ADC_SMPR1_SMP25_SHIFT        (15)      /* Bits 15-17: Channel 25 Sample time selection */
#define ADC_SMPR1_SMP25_MASK         (7 << ADC_SMPR1_SMP25_SHIFT)
#define ADC_SMPR1_SMP26_SHIFT        (18)      /* Bits 18-20: Channel 26 Sample time selection */
#define ADC_SMPR1_SMP26_MASK         (7 << ADC_SMPR1_SMP26_SHIFT)
#define ADC_SMPR1_SMP27_SHIFT        (21)      /* Bits 21-23: Channel 27 Sample time selection */
#define ADC_SMPR1_SMP27_MASK         (7 << ADC_SMPR1_SMP27_SHIFT)
#define ADC_SMPR1_SMP28_SHIFT        (24)      /* Bits 24-26: Channel 28 Sample time selection */
#define ADC_SMPR1_SMP28_MASK         (7 << ADC_SMPR1_SMP28_SHIFT)
#define ADC_SMPR1_SMP29_SHIFT        (27)      /* Bits 27-29: Channel 29 Sample time selection */
#define ADC_SMPR1_SMP29_MASK         (7 << ADC_SMPR1_SMP29_SHIFT)

/* ADC sample time register 2 */

#define ADC_SMPR2_SMP10_SHIFT        (0)       /* Bits 0-2: Channel 10 Sample time selection */
#define ADC_SMPR2_SMP10_MASK         (7 << ADC_SMPR2_SMP10_SHIFT)
#define ADC_SMPR2_SMP11_SHIFT        (3)       /* Bits 3-5: Channel 11 Sample time selection */
#define ADC_SMPR2_SMP11_MASK         (7 << ADC_SMPR2_SMP11_SHIFT)
#define ADC_SMPR2_SMP12_SHIFT        (6)       /* Bits 6-8: Channel 12 Sample time selection */
#define ADC_SMPR2_SMP12_MASK         (7 << ADC_SMPR2_SMP12_SHIFT)
#define ADC_SMPR2_SMP13_SHIFT        (9)       /* Bits 9-11: Channel 13 Sample time selection */
#define ADC_SMPR2_SMP13_MASK         (7 << ADC_SMPR2_SMP13_SHIFT)
#define ADC_SMPR2_SMP14_SHIFT        (12)      /* Bits 12-14: Channel 14 Sample time selection */
#define ADC_SMPR2_SMP14_MASK         (7 << ADC_SMPR2_SMP14_SHIFT)
#define ADC_SMPR2_SMP15_SHIFT        (15)      /* Bits 15-17: Channel 15 Sample time selection */
#define ADC_SMPR2_SMP15_MASK         (7 << ADC_SMPR2_SMP15_SHIFT)
#define ADC_SMPR2_SMP16_SHIFT        (18)      /* Bits 18-20: Channel 16 Sample time selection */
#define ADC_SMPR2_SMP16_MASK         (7 << ADC_SMPR2_SMP16_SHIFT)
#define ADC_SMPR2_SMP17_SHIFT        (21)      /* Bits 21-23: Channel 17 Sample time selection */
#define ADC_SMPR2_SMP17_MASK         (7 << ADC_SMPR2_SMP17_SHIFT)
#define ADC_SMPR2_SMP18_SHIFT        (24)      /* Bits 24-26: Channel 18 Sample time selection */
#define ADC_SMPR2_SMP18_MASK         (7 << ADC_SMPR2_SMP18_SHIFT)
#define ADC_SMPR2_SMP19_SHIFT        (27)      /* Bits 27-29: Channel 18 Sample time selection */
#define ADC_SMPR2_SMP19_MASK         (7 << ADC_SMPR2_SMP19_SHIFT)

/* ADC sample time register 3 */

#define ADC_SMPR3_SMP0_SHIFT         (0)       /* Bits 2-0: Channel 0 Sample time selection */
#define ADC_SMPR3_SMP0_MASK          (7 << ADC_SMPR3_SMP0_SHIFT)
#define ADC_SMPR3_SMP1_SHIFT         (3)       /* Bits 5-3: Channel 1 Sample time selection */
#define ADC_SMPR3_SMP1_MASK          (7 << ADC_SMPR3_SMP1_SHIFT)
#define ADC_SMPR3_SMP2_SHIFT         (6)       /* Bits 8-6: Channel 2 Sample time selection */
#define ADC_SMPR3_SMP2_MASK          (7 << ADC_SMPR3_SMP2_SHIFT)
#define ADC_SMPR3_SMP3_SHIFT         (9)       /* Bits 11-9: Channel 3 Sample time selection */
#define ADC_SMPR3_SMP3_MASK          (7 << ADC_SMPR3_SMP3_SHIFT)
#define ADC_SMPR3_SMP4_SHIFT         (12)      /* Bits 14-12: Channel 4 Sample time selection */
#define ADC_SMPR3_SMP4_MASK          (7 << ADC_SMPR3_SMP4_SHIFT)
#define ADC_SMPR3_SMP5_SHIFT         (15)      /* Bits 17-15: Channel 5 Sample time selection */
#define ADC_SMPR3_SMP5_MASK          (7 << ADC_SMPR3_SMP5_SHIFT)
#define ADC_SMPR3_SMP6_SHIFT         (18)      /* Bits 20-18: Channel 6 Sample time selection */
#define ADC_SMPR3_SMP6_MASK          (7 << ADC_SMPR3_SMP6_SHIFT)
#define ADC_SMPR3_SMP7_SHIFT         (21)      /* Bits 23-21: Channel 7 Sample time selection */
#define ADC_SMPR3_SMP7_MASK          (7 << ADC_SMPR3_SMP7_SHIFT)
#define ADC_SMPR3_SMP8_SHIFT         (24)      /* Bits 26-24: Channel 8 Sample time selection */
#define ADC_SMPR3_SMP8_MASK          (7 << ADC_SMPR3_SMP8_SHIFT)
#define ADC_SMPR3_SMP9_SHIFT         (27)      /* Bits 29-27: Channel 9 Sample time selection */
#define ADC_SMPR3_SMP9_MASK          (7 << ADC_SMPR3_SMP9_SHIFT)

