apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v1l1.h
/* ADC sample time register 0 */

#define ADC_SMPR0_SMP30_SHIFT        (0)       /* Bits 2-0: Channel 30 Sample time selection */
#define ADC_SMPR0_SMP30_MASK         (7 << ADC_SMPR3_SMP30_SHIFT)
#define ADC_SMPR0_SMP31_SHIFT        (3)       /* Bits 5-3: Channel 31 Sample time selection */
#define ADC_SMPR0_SMP31_MASK         (7 << ADC_SMPR3_SMP31_SHIFT)

/* ADC injected channel data offset register 1-4 */

#define ADC_JOFR_SHIFT               (0)       /* Bits 11-0: Data offset for injected channel x */
#define ADC_JOFR_MASK                (0x0fff << ADC_JOFR_SHIFT)

/* ADC watchdog high threshold register */

#define ADC_HTR_SHIFT                (0)       /* Bits 11-0: Analog watchdog high threshold */
#define ADC_HTR_MASK                 (0x0fff << ADC_HTR_SHIFT)

/* ADC watchdog low threshold register */

#define ADC_LTR_SHIFT                (0)       /* Bits 11-0: Analog watchdog low threshold */
#define ADC_LTR_MASK                 (0x0fff << ADC_LTR_SHIFT)

/* ADC regular sequence register 1 */

#define ADC_SQR1_SQ25_SHIFT          (0)       /* Bits 4-0: 25th conversion in regular sequence */
#define ADC_SQR1_SQ25_MASK           (0x1f << ADC_SQR1_SQ25_SHIFT)
#define ADC_SQR1_SQ26_SHIFT          (5)       /* Bits 9-5: 26th conversion in regular sequence */
#define ADC_SQR1_SQ26_MASK           (0x1f << ADC_SQR1_SQ26_SHIFT)
#define ADC_SQR1_SQ27_SHIFT          (10)      /* Bits 14-10: 27th conversion in regular sequence */
#define ADC_SQR1_SQ27_MASK           (0x1f << ADC_SQR1_SQ27_SHIFT)
#define ADC_SQR1_SQ28_SHIFT          (15)      /* Bits 19-15: 28th conversion in regular sequence */
#define ADC_SQR1_SQ28_MASK           (0x1f << ADC_SQR1_SQ28_SHIFT)
#define ADC_SQR1_L_SHIFT             (20)      /* Bits 24-20: Regular channel sequence length */
#define ADC_SQR1_L_MASK              (0x1f << ADC_SQR1_L_SHIFT)
#define ADC_SQR1_RESERVED            (0xff000000)
#define ADC_SQR1_FIRST               (25)
#define ADC_SQR1_LAST                (28)
#define ADC_SQR1_SQ_OFFSET           (0)

/* ADC regular sequence register 2 */

#define ADC_SQR2_SQ19_SHIFT          (0)       /* Bits 4-0: 19th conversion in regular sequence */
#define ADC_SQR2_SQ19_MASK           (0x1f << ADC_SQR2_SQ19_SHIFT)
#define ADC_SQR2_SQ20_SHIFT          (5)       /* Bits 9-5: 20th conversion in regular sequence */
#define ADC_SQR2_SQ20_MASK           (0x1f << ADC_SQR2_SQ20_SHIFT)
#define ADC_SQR2_SQ21_SHIFT          (10)      /* Bits 14-10: 21th conversion in regular sequence */
#define ADC_SQR2_SQ21_MASK           (0x1f << ADC_SQR2_SQ21_SHIFT)
#define ADC_SQR2_SQ22_SHIFT          (15)      /* Bits 19-15: 22th conversion in regular sequence */
#define ADC_SQR2_SQ22_MASK           (0x1f << ADC_SQR2_SQ22_SHIFT)
#define ADC_SQR2_SQ23_SHIFT          (20)      /* Bits 24-20: 23th conversion in regular sequence */
#define ADC_SQR2_SQ23_MASK           (0x1f << ADC_SQR2_SQ23_SHIFT )
#define ADC_SQR2_SQ24_SHIFT          (25)      /* Bits 29-25: 24th conversion in regular sequence */
#define ADC_SQR2_SQ24_MASK           (0x1f << ADC_SQR2_SQ24_SHIFT)
#define ADC_SQR2_RESERVED            (0xc0000000)
#define ADC_SQR2_FIRST               (19)
#define ADC_SQR2_LAST                (24)
#define ADC_SQR2_SQ_OFFSET           (0)

/* ADC regular sequence register 3 */

#define ADC_SQR3_SQ13_SHIFT          (0)       /* Bits 4-0: 13th conversion in regular sequence */
#define ADC_SQR3_SQ13_MASK           (0x1f << ADC_SQR3_SQ13_SHIFT)
#define ADC_SQR3_SQ14_SHIFT          (5)       /* Bits 9-5: 14th conversion in regular sequence */
#define ADC_SQR3_SQ14_MASK           (0x1f << ADC_SQR3_SQ14_SHIFT)
#define ADC_SQR3_SQ15_SHIFT          (10)      /* Bits 14-10: 15th conversion in regular sequence */
#define ADC_SQR3_SQ15_MASK           (0x1f << ADC_SQR3_SQ15_SHIFT)
#define ADC_SQR3_SQ16_SHIFT          (15)      /* Bits 19-15: 16th conversion in regular sequence */
#define ADC_SQR3_SQ16_MASK           (0x1f << ADC_SQR3_SQ16_SHIFT)
#define ADC_SQR3_SQ17_SHIFT          (20)      /* Bits 24-20: 17th conversion in regular sequence */
#define ADC_SQR3_SQ17_MASK           (0x1f << ADC_SQR3_SQ17_SHIFT )
#define ADC_SQR3_SQ18_SHIFT          (25)      /* Bits 29-25: 18th conversion in regular sequence */
#define ADC_SQR3_SQ18_MASK           (0x1f << ADC_SQR3_SQ18_SHIFT)
#define ADC_SQR3_RESERVED            (0xc0000000)
#define ADC_SQR3_FIRST               (13)
#define ADC_SQR3_LAST                (18)
#define ADC_SQR3_SQ_OFFSET           (0)

/* ADC regular sequence register 4 */

#define ADC_SQR4_SQ7_SHIFT           (0)       /* Bits 4-0: 7th conversion in regular sequence */
#define ADC_SQR4_SQ7_MASK            (0x1f << ADC_SQR4_SQ7_SHIFT)
#define ADC_SQR4_SQ8_SHIFT           (5)       /* Bits 9-5: 8th conversion in regular sequence */
#define ADC_SQR4_SQ8_MASK            (0x1f << ADC_SQR4_SQ8_SHIFT)
#define ADC_SQR4_SQ9_SHIFT           (10)      /* Bits 14-10: 9th conversion in regular sequence */
#define ADC_SQR4_SQ9_MASK            (0x1f << ADC_SQR4_SQ9_SHIFT)
#define ADC_SQR4_SQ10_SHIFT          (15)      /* Bits 19-15: 10th conversion in regular sequence */
#define ADC_SQR4_SQ10_MASK           (0x1f << ADC_SQR4_SQ10_SHIFT)
#define ADC_SQR4_SQ11_SHIFT          (20)      /* Bits 24-20: 11th conversion in regular sequence */
#define ADC_SQR4_SQ11_MASK           (0x1f << ADC_SQR4_SQ11_SHIFT )
#define ADC_SQR4_SQ12_SHIFT          (25)      /* Bits 29-25: 12th conversion in regular sequence */
#define ADC_SQR4_SQ12_MASK           (0x1f << ADC_SQR4_SQ12_SHIFT)
#define ADC_SQR4_RESERVED            (0xc0000000)
#define ADC_SQR4_FIRST               (7)
#define ADC_SQR4_LAST                (12)
#define ADC_SQR4_SQ_OFFSET           (0)

/* ADC regular sequence register 5 */

#define ADC_SQR5_SQ1_SHIFT           (0)       /* Bits 4-0: 1st conversion in regular sequence */
#define ADC_SQR5_SQ1_MASK            (0x1f << ADC_SQR5_SQ1_SHIFT)
#define ADC_SQR5_SQ2_SHIFT           (5)       /* Bits 9-5: 2nd conversion in regular sequence */
#define ADC_SQR5_SQ2_MASK            (0x1f << ADC_SQR5_SQ2_SHIFT)
#define ADC_SQR5_SQ3_SHIFT           (10)      /* Bits 14-10: 3rd conversion in regular sequence */
#define ADC_SQR5_SQ3_MASK            (0x1f << ADC_SQR5_SQ3_SHIFT)
#define ADC_SQR5_SQ4_SHIFT           (15)      /* Bits 19-15: 4th conversion in regular sequence */
#define ADC_SQR5_SQ4_MASK            (0x1f << ADC_SQR5_SQ4_SHIFT)
#define ADC_SQR5_SQ5_SHIFT           (20)      /* Bits 24-20: 5th conversion in regular sequence */
#define ADC_SQR5_SQ5_MASK            (0x1f << ADC_SQR5_SQ5_SHIFT )
#define ADC_SQR5_SQ6_SHIFT           (25)      /* Bits 29-25: 6th conversion in regular sequence */
#define ADC_SQR5_SQ6_MASK            (0x1f << ADC_SQR5_SQ6_SHIFT)
#define ADC_SQR5_RESERVED            (0xc0000000)
#define ADC_SQR5_FIRST               (1)
#define ADC_SQR5_LAST                (6)
#define ADC_SQR5_SQ_OFFSET           (0)

/* Offset between SQ bits */

#define ADC_SQ_OFFSET                (5)

/* ADC injected sequence register */

#define ADC_JSQR_JSQ1_SHIFT          (0)       /* Bits 4-0: 1st conversion in injected sequence */
#define ADC_JSQR_JSQ1_MASK           (0x1f << ADC_JSQR_JSQ1_SHIFT)
#define ADC_JSQR_JSQ2_SHIFT          (5)       /* Bits 9-5: 2nd conversion in injected sequence */
#define ADC_JSQR_JSQ2_MASK           (0x1f << ADC_JSQR_JSQ2_SHIFT)
#define ADC_JSQR_JSQ3_SHIFT          (10)      /* Bits 14-10: 3rd conversion in injected sequence */
#define ADC_JSQR_JSQ3_MASK           (0x1f << ADC_JSQR_JSQ3_SHIFT)
#define ADC_JSQR_JSQ4_SHIFT          (15)      /* Bits 19-15: 4th conversion in injected sequence */
#define ADC_JSQR_JSQ4_MASK           (0x1f << ADC_JSQR_JSQ4_SHIFT)
#define ADC_JSQR_JSQ_SHIFT           (5)       /* Shift between JSQx bits */
#define ADC_JSQR_JL_SHIFT            (20)      /* Bits 21-20: Injected Sequence length */
#define ADC_JSQR_JL_MASK             (3 << ADC_JSQR_JL_SHIFT)
#  define ADC_JSQR_JL(n)             (((n)-1) << ADC_JSQR_JL_SHIFT) /* n=1..4 */

/* ADC injected data register 1-4 */

#define ADC_JDR_JDATA_SHIFT          (0)       /* Bits 15-0: Injected data */
#define ADC_JDR_JDATA_MASK           (0xffff << ADC_JDR_JDATA_SHIFT)

