apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v1l1.h
/* ADC regular data register */

#define ADC_DR_RDATA_SHIFT           (0)       /* Bits 15-0 Regular data */
#define ADC_DR_RDATA_MASK            (0xffff << ADC_DR_RDATA_SHIFT)

/* Common status register */

#define ADC_CSR_AWD1                 (1 << 0)  /* Bit 0:  Analog watchdog flag of ADC1   (copy of AWD in ADC1_SR) */
#define ADC_CSR_EOC1                 (1 << 1)  /* Bit 1:  End of conversion of ADC1   (copy of EOC in ADC1_SR) */
#define ADC_CSR_JEOC1                (1 << 2)  /* Bit 2:  Injected channel end of conversion of ADC1   (copy of JEOC in ADC1_SR) */
#define ADC_CSR_JSTRT1               (1 << 3)  /* Bit 3:  Injected channel Start flag of ADC1   (copy of JSTRT in ADC1_SR) */
#define ADC_CSR_STRT1                (1 << 4)  /* Bit 4:  Regular channel Start flag of ADC1   (copy of STRT in ADC1_SR) */
#define ADC_CSR_OVR1                 (1 << 5)  /* Bit 5:  Overrun flag of ADC1   (copy of OVR in ADC1_SR) */
                                               /* Bits 6-7: Reserved, must be kept at reset value. */
#define ADC_CSR_ADONS1               (1 << 6)  /* Bit 6: ADON Status of ADC1. This bit is a copy of the ADONS bit in the ADC_SR register. */

/* Common control register */

/*                                                Bits 15-0: Reserved,
 * must be kept at reset value
 */

#define ADC_CCR_ADCPRE_SHIFT         (16)      /* Bits 16-17: ADC prescaler */
#define ADC_CCR_ADCPRE_MASK          (3 << ADC_CCR_ADCPRE_SHIFT)
#  define ADC_CCR_ADCPRE_DIV1        (0 << ADC_CCR_ADCPRE_SHIFT) /* HSI divided by 1 */
#  define ADC_CCR_ADCPRE_DIV2        (1 << ADC_CCR_ADCPRE_SHIFT) /* HSI divided by 2 */
#  define ADC_CCR_ADCPRE_DIV4        (2 << ADC_CCR_ADCPRE_SHIFT) /* HSI divided by 4 */
                                                                 /* 11: Reserved */

/*                                                Bits 22-18: Reserved,
 * must be kept at reset value
 */
#define ADC_CCR_TSVREFE              (1 << 23) /* Bit 23: Temperature sensor and VREFINT enable */
                                               /* Bits 31-24: Reserved, must be kept at reset value */

/* Data register for dual and triple modes
 *(32-bit data with no named fields)
 */

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_ADC_V1L1_H */
